codeigniter4/app/Controllers/Career.php

SELECT *
FROM `careers`
---
    public function index(){
        // $studentModel = new StudentModel();
        $data['pageTitle'] = 'Careers Page';
        $data['showLogo'] = true;
        $careerModel= model(careerModel::class);
        $data['careers'] = $careerModel->findAll();

SELECT *
FROM `careers`
WHERE `id` = '2'
 LIMIT 1
---
    public function edit($id){
        $careerModel = model(CareerModel::class);
        $data['career'] = $careerModel->where('id', $id)->first();

UPDATE `careers` SET `name` = 'Nacion'
WHERE `careers`.`id` IN ('2')
---
    public function save() {
        $careerModel = model(CareerModel::class);
        $id = $this->request->getVar('id');
        $data = [
            'name' => $this->request->getVar('name'),
        ];
        if ($id) {
            $careerModel->update($id, $data);