codeigniter4/app/Controllers/Student.php

    public function index(){
        // $studentModel = new StudentModel();
        $data['pageTitle'] = 'Students Page';
        $data['showLogo'] = true;
        $studentModel = model(StudentModel::class);
        $data['students'] = $studentModel->findAll();

        $careerModel = model(CareerModel::class);
        $data['careers'] = $careerModel->findAll();
---
SELECT *
FROM `students`
SELECT *
FROM `careers`

    public function create(){
        $data['pageTitle'] = 'New Student';
        $data['actionTitle'] = 'Create Student';

        $careerModel = model(CareerModel::class);
        $data['careers'] = $careerModel->findAll();
---
SELECT *
FROM `careers`

    public function edit($id){

        $careerModel = model(CareerModel::class);
        $data['careers'] = $careerModel->findAll();

        $studentModel = model(StudentModel::class);
        $data['student'] = $studentModel->where('id', $id)->first();
---
SELECT *
FROM `careers`
SELECT *
FROM `students`
WHERE `id` = '8'
 LIMIT 1

    public function save() {
        $studentModel = model(StudentModel::class);
        $id = $this->request->getVar('id');



        $data = [
            'name' => $this->request->getVar('name'),
            'last_name'  => $this->request->getVar('last_name'),
            'address'  => $this->request->getVar('address'),
            'id_career'  => $this->request->getVar('id_career'),
        ];
        if ($id) {
            $studentModel->update($id, $data);
        } else {
            $studentModel->insert($data);
---
UPDATE `students` SET `name` = 'Joseph', `last_name` = 'Mendez', `address` = 'CQ', `id_career` = '2'
WHERE `students`.`id` IN ('8')
INSERT INTO `students` (`name`, `last_name`, `address`, `id_career`) VALUES ('Joseph', 'Mendez', 'CQ', '2')

    public function delete($id = null){
        $studentModel = model(StudentModel::class);
        $studentModel->where('id', $id)->delete();
---
DELETE FROM `students`
WHERE `id` = '7'